#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.logging_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg][0m
[0m[1mazurerm_resource_group.app_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-logic-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001][0m
[0m[1mazurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001][0m
[0m[1mazurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/serverfarms/mylogic-dev-asp001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-logic-nsg001][0m
[0m[1mazapi_resource.subnet_logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/LogicAppSubnet][0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Web/locations/northeurope/managedApis/arm][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001][0m
[0m[1mazapi_resource.api_connection_arm: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/connections/mylogic-dev-api-arm001][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001/providers/Microsoft.Authorization/roleAssignments/4789c815-20a2-aa26-6360-72b2dcd483b8][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001|logAnalytics][0m
[0m[1mazapi_resource.storage_file_share: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/fileServices/default/shares/logicapp][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Reading...[0m[0m
[0m[1mazurerm_storage_management_policy.storage_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/managementPolicies/default][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001|logAnalytics][0m
[0m[1mazapi_resource.subnet_services: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-blob-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_table: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-table-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_file: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-file-pe][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogic-dev-vault001-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogicdevstg001-queue-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.Insights/components/mylogic-dev-appi001|logAnalytics][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_sample: Refreshing state... [id=https://mylogic-dev-vault001.vault.azure.net/secrets/MySampleSecret/afcd6db3c65a4b24ab82b92167b13e28][0m
[0m[1mazurerm_logic_app_standard.logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001][0m
[0m[1mazapi_resource.api_connection_arm_access_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/connections/mylogic-dev-api-arm001/accessPolicies/mylogic-dev-la001-9a6a5483-cc1f-43b8-a599-c73e9c4bd6cc][0m
[0m[1mazurerm_role_assignment.logic_app_role_assignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001/providers/Microsoft.Authorization/roleAssignments/da3136e6-476d-443c-3837-9f00fd4df1cf][0m
[0m[1mazurerm_private_endpoint.logic_app_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Network/privateEndpoints/mylogic-dev-la001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001|logAnalytics][0m
[0m[1mazurerm_role_assignment.logic_app_role_assignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/mylogicdevstg001/providers/Microsoft.Authorization/roleAssignments/a7587a11-a631-5e54-0fb7-26c39d7400af][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # azurerm_key_vault.key_vault[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_key_vault" "key_vault" {
      [31m-[0m[0m id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/mylogic-dev-vault001" [90m-> null[0m[0m
      [31m-[0m[0m name                            = "mylogic-dev-vault001" [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name             = "mylogic-dev-app-rg" [90m-> null[0m[0m
        tags                            = {}
      [31m-[0m[0m vault_uri                       = "https://mylogic-dev-vault001.vault.azure.net/" [90m-> null[0m[0m
        [90m# (11 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_sample[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_sample" {
      [31m-[0m[0m id                      = "https://mylogic-dev-vault001.vault.azure.net/secrets/MySampleSecret/afcd6db3c65a4b24ab82b92167b13e28" [90m-> null[0m[0m
        name                    = "MySampleSecret"
        tags                    = {}
        [90m# (7 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_logic_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_logic_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001"
    }

[1m  # azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "mylogic-dev-vault001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "mylogic-dev-app-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_sample[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_sample" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "MySampleSecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_logic_app_standard.logic_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_logic_app_standard" "logic_app" {
      [33m~[0m[0m app_settings                   = {
          [31m-[0m[0m "APPINSIGHTS_INSTRUMENTATIONKEY"                      = (sensitive value)
          [31m-[0m[0m "APPLICATIONINSIGHTS_CONNECTION_STRING"               = (sensitive value)
          [31m-[0m[0m "FUNCTIONS_WORKER_RUNTIME"                            = "node"
          [31m-[0m[0m "KEY_VAULT_URI"                                       = "https://mylogic-dev-vault001.vault.azure.net/"
          [31m-[0m[0m "MY_AZURE_SUBSCRIPTION"                               = "8f171ff9-2b5b-4f0f-aed5-7fa360a1d094"
          [31m-[0m[0m "MY_CONFIG"                                           = "value"
          [31m-[0m[0m "MY_SECRET_CONFIG"                                    = "@Microsoft.KeyVault(SecretUri=https://mylogic-dev-vault001.vault.azure.net/secrets/MySampleSecret/afcd6db3c65a4b24ab82b92167b13e28)"
          [31m-[0m[0m "ServiceProviders.MaximumAllowedTriggerStateSizeInKB" = "10"
          [31m-[0m[0m "WEBSITE_CONTENTOVERVNET"                             = "1"
          [31m-[0m[0m "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                     = "true"
          [31m-[0m[0m "WEBSITE_NODE_DEFAULT_VERSION"                        = "~18"
          [31m-[0m[0m "WEBSITE_RUN_FROM_PACKAGE"                            = "1"
          [31m-[0m[0m "Workflows.RuntimeConfiguration.RetentionInDays"      = "90"
        } -> (known after apply)
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001"
        name                           = "mylogic-dev-la001"
        tags                           = {}
        [90m# (20 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m site_config {
          [33m~[0m[0m ip_restriction                   = [
              [31m-[0m[0m {
                  [31m-[0m[0m action                    = "Allow"
                  [31m-[0m[0m headers                   = []
                  [31m-[0m[0m ip_address                = "89.247.164.240/32"
                  [31m-[0m[0m name                      = "myip"
                  [31m-[0m[0m priority                  = 100
                  [31m-[0m[0m service_tag               = ""
                  [31m-[0m[0m virtual_network_subnet_id = ""
                },
            ]
          [33m~[0m[0m scm_ip_restriction               = [
              [31m-[0m[0m {
                  [31m-[0m[0m action                    = "Allow"
                  [31m-[0m[0m headers                   = []
                  [31m-[0m[0m ip_address                = "89.247.164.240/32"
                  [31m-[0m[0m name                      = "myip"
                  [31m-[0m[0m priority                  = 100
                  [31m-[0m[0m service_tag               = ""
                  [31m-[0m[0m virtual_network_subnet_id = ""
                },
            ]
            [90m# (15 unchanged attributes hidden)[0m[0m

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/mylogic-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_logic_app" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mylogic-dev-app-rg/providers/Microsoft.Web/sites/mylogic-dev-la001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 30 [90m-> null[0m[0m
              [31m-[0m[0m enabled = true [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_private_endpoint.key_vault_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mylogic-dev-vault001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mylogic-dev-vault001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mylogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mylogic-dev-vault001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mylogic-dev-vault001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # azurerm_role_assignment.current_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "9a6a5483-cc1f-43b8-a599-c73e9c4bd6cc"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1mPlan:[0m 6 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>